function decode(obj) {
   let str = obj.answer
   let res = obj.result
   let answer = [];
   let result = [];
   if(str) {
      str = str.split(',')
      str.pop()
      str.forEach((el) => {
         let answ = []
         if(el.includes('*')) {
            el = el.split('*')
            for(let i = 0; i < el[1]; i++) {
               answ.push(el[0])
            }
         }
         answer = [...answer, ...answ]
      })
   }
   if(res) {
      let buffer = '';
      for (let i = 0; i < res.length; i++) {
         if (!isNaN(res[i])) { 
            buffer += res[i];
         } else {
            const numCount = res.charCodeAt(i);
            result = result.concat(Array(numCount).fill(parseInt(buffer)));
            buffer = '';
         }
      }
   }
   if(answer.length <= result.length) {
      return result
   } else {
      return answer
   }
}

function encode(nums) {
   const counts = Array(300).fill(0);
   nums.forEach(num => counts[num-1]++);
   let result = '';
   for (let i = 0; i < 300; i++) {
      if (counts[i] === 0) continue;
      let compressed = String.fromCharCode(counts[i]); 
      result += (i + 1) + compressed; 
   }
   nums.sort((a, b) => a - b);
   let answer = ''
   let str = ''
   for(let i = 0; i < nums.length; i++) {
      // if(i+1 >= nums.length-1) continue
      let num = nums[i]
      let num_n = nums[i+1]
      str += num
      if(num == num_n) {
         str += '*'
      } else {
         str += ','
      }
   }
   str = str.split(',')
   str.pop()
   for(let i = 0; i < str.length; i++) {
      let rep = str[i]
      if(rep) {
         rep = rep.split('*')
         answer += rep[0]+'*'+rep.length+','
      }
   }
   let sum
   if(decode({answer}).length <= decode({result}).length) {
      sum = result
   } else {
      sum = answer
   }
   return {
      answer,
      result,
      sum
   }
}

function serialize(arr) {
   arr.sort((a, b) => a - b);
   let result = '';
   for (let i = 0; i < arr.length; ) {
       const start = arr[i];
       let end = start;
       while (arr[i + 1] == end + 1) {
           i++;
           end++;
       }
       result += start.toString();
       if (end > start) {
           result += '-' + end.toString();
       }
       result += ',';
       i++;
   }
   return {
      sum: result
   };
}

function deserialize(str) {
   const ranges = str.split(',');
   let result = [];
   for (let range of ranges) {
       if (range.includes('-')) {
           let [start, end] = range.split('-');
           start = parseInt(start);
           end = parseInt(end);
           for (let i = start; i <= end; i++) {
               result.push(i);
           }
       } else if (range != '') {
           result.push(parseInt(range));
       }
   }
   return result;
}

function check_arr(arr) {
   arr.sort((a, b) => a - b);
   let ev = 0;
   let sbs = 0;
   for(let i = 0; i < arr.length; i++) {
      if(i+1 >= arr.length) continue
      let num = arr[i]
      let next_num = arr[i+1]
      if(num == next_num) {
         ev++
      } else if(next_num - num == 1) {
         sbs++
      }
   }
   
   return ev >= sbs
}

function code(arr) {
   let check = check_arr(arr)
   if(check) {
      return {
         str: encode(arr),
         type: 'enc'
      }
   } else {
      return {
         str: serialize(arr),
         type: 'srl'
      }
   }
}

function de_code(str) {
   if(str.type == 'enc') {
      return decode(str.str)
   } else {
      return deserialize(str.str.sum)
   }
}

let koeff = []
let arr = [1,1,1,1,1,2,2,2,3,3,3,3,4,5,6,287,290,300]
let ser = code(arr)
let deser = de_code(ser)
console.log('Исходный массив, мало чисел, больше повторяющихся:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`

Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}



`)
arr = [2,3,4,5,8,23,12,45,34]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, мало чисел, больше последовательных:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)
arr = [90, 185, 24, 221, 242, 294, 207, 49, 286, 27, 202, 90, 93, 173, 99, 39, 160, 20, 76, 48, 202, 188, 58, 16, 120, 86, 162, 89, 245, 101, 91, 264, 218, 25, 218, 123, 254, 79, 15, 287, 162, 96, 136, 202, 213, 133, 19, 190, 92, 59]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, 50 рандомных чисел:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)
arr = [5, 152, 91, 153, 218, 16, 191, 63, 256, 90, 207, 119, 178, 135, 36, 91, 100, 295, 93, 109, 167, 51, 161, 34, 282, 217, 196, 129, 30, 56, 90, 139, 26, 93, 267, 241, 146, 96, 92, 237, 167, 35, 16, 289, 233, 289, 221, 48, 214, 165, 40, 175, 173, 145, 125, 113, 155, 40, 7, 204, 50, 266, 159, 39, 31, 258, 11, 99, 157, 65, 139, 273, 250, 7, 1, 100, 90, 184, 184, 106, 252, 119, 180, 278, 128, 24, 118, 58, 118, 128, 174, 190, 223, 208, 249, 204, 207, 293, 278, 60]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, 100 рандомных чисел:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)
arr = [117, 101, 13, 48, 16, 162, 251, 242, 222, 170, 32, 269, 203, 137, 139, 199, 289, 126, 79, 74, 243, 27, 93, 271, 283, 266, 33, 6, 122, 52, 41, 79, 264, 160, 227, 291, 251, 39, 73, 120, 291, 40, 128, 31, 118, 183, 209, 267, 44, 256, 296, 22, 196, 25, 286, 138, 8, 299, 269, 168, 13, 103, 202, 201, 9, 80, 189, 177, 28, 199, 10, 80, 132, 264, 11, 47, 297, 139, 155, 272, 1, 178, 234, 100, 4, 171, 59, 253, 216, 261, 156, 148, 112, 186, 160, 87, 276, 168, 244, 56, 43, 90, 2, 134, 160, 136, 102, 257, 202, 208, 269, 113, 258, 145, 7, 40, 63, 155, 274, 152, 183, 200, 148, 188, 236, 217, 248, 54, 213, 174, 181, 33, 7, 53, 113, 204, 13, 57, 200, 246, 265, 147, 212, 187, 200, 232, 281, 98, 10, 210, 282, 66, 293, 45, 225, 62, 113, 86, 32, 78, 297, 217, 244, 4, 41, 291, 112, 123, 24, 239, 166, 250, 72, 204, 291, 162, 206, 10, 112, 222, 275, 220, 211, 106, 108, 5, 141, 203, 130, 226, 262, 196, 81, 58, 68, 166, 148, 290, 174, 208, 9, 67, 241, 8, 192, 224, 50, 133, 297, 38, 94, 173, 160, 233, 128, 194, 106, 81, 261, 177, 233, 286, 121, 219, 213, 234, 139, 17, 241, 13, 86, 112, 31, 244, 286, 117, 15, 184, 41, 70, 260, 171, 202, 260, 32, 295, 17, 223, 260, 176, 267, 136, 270, 79, 265, 145, 77, 68, 33, 241, 265, 215, 181, 30, 157, 49, 127, 235, 92, 88, 189, 153, 207, 174, 54, 77, 27, 128, 81, 271, 192, 224, 235, 194, 185, 196, 234, 97, 9, 68, 77, 112, 238, 185, 129, 291, 245, 18, 253, 128, 10, 254, 242, 80, 73, 274, 224, 270, 79, 105, 186, 241, 83, 173, 291, 10, 126, 93, 9, 277, 11, 118, 79, 147, 93, 73, 16, 143, 294, 152, 15, 82, 26, 186, 253, 35, 10, 58, 213, 296, 7, 115, 252, 20, 287, 218, 139, 40, 87, 41, 87, 295, 63, 154, 295, 154, 210, 132, 105, 118, 224, 212, 133, 36, 106, 261, 120, 243, 293, 174, 115, 174, 283, 256, 22, 111, 15, 278, 290, 48, 24, 155, 172, 277, 266, 12, 140, 279, 135, 141, 93, 213, 84, 74, 32, 129, 81, 214, 8, 268, 34, 246, 242, 230, 129, 143, 171, 297, 183, 80, 204, 26, 126, 263, 245, 115, 165, 64, 116, 45, 151, 234, 83, 232, 264, 257, 20, 142, 77, 292, 84, 281, 286, 182, 48, 113, 248, 155, 261, 9, 101, 173, 273, 42, 289, 117, 193, 34, 171, 8, 35, 188, 100, 198, 88, 254, 47, 214, 84, 265, 297, 223, 266, 295, 160, 96, 54, 175, 171, 255, 243, 240, 130, 201, 181, 200, 204, 222, 133, 18, 240, 83, 206, 104, 133, 230, 118, 194, 50, 87, 173, 184, 30, 213, 58, 8, 94, 256, 109, 168]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, 500 рандомных чисел:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)
arr = [230, 147, 20, 218, 275, 288, 9, 41, 172, 19, 41, 57, 79, 127, 192, 256, 235, 197, 110, 47, 299, 262, 142, 232, 292, 178, 92, 54, 42, 10, 33, 67, 149, 118, 10, 32, 44, 152, 116, 217, 268, 10, 150, 24, 211, 261, 235, 175, 179, 214, 222, 253, 5, 287, 255, 269, 161, 245, 55, 215, 31, 263, 297, 219, 79, 262, 41, 235, 38, 237, 39, 153, 275, 296, 142, 242, 288, 170, 36, 19, 34, 229, 242, 223, 13, 165, 51, 179, 85, 138, 255, 279, 259, 294, 181, 123, 285, 48, 213, 152, 24, 33, 251, 133, 111, 131, 110, 227, 225, 13, 98, 148, 272, 266, 122, 171, 231, 170, 38, 292, 178, 54, 145, 65, 217, 86, 155, 83, 300, 41, 142, 92, 142, 65, 229, 2, 217, 118, 71, 271, 127, 59, 6, 179, 204, 104, 256, 222, 286, 296, 54, 92, 21, 286, 280, 247, 127, 198, 2, 132, 174, 253, 87, 255, 267, 272, 124, 127, 285, 206, 163, 184, 258, 69, 37, 158, 270, 51, 251, 27, 81, 214, 286, 105, 58, 62, 224, 246, 207, 96, 56, 73, 113, 48, 56, 127, 20, 181, 269, 148, 164, 294, 9, 227, 136, 284, 146, 136, 48, 283, 146, 196, 169, 19, 110, 70, 295, 85, 99, 297, 29, 94, 157, 22, 216, 261, 93, 226, 136, 15, 107, 56, 262, 101, 294, 218, 12, 23, 97, 130, 28, 169, 169, 294, 6, 165, 239, 201, 203, 66, 122, 105, 78, 39, 141, 247, 21, 165, 240, 121, 32, 109, 287, 158, 35, 280, 164, 127, 128, 201, 183, 150, 88, 165, 181, 217, 250, 262, 274, 21, 113, 230, 97, 59, 248, 256, 205, 13, 8, 159, 57, 35, 77, 111, 195, 68, 116, 192, 80, 276, 118, 31, 17, 92, 173, 245, 272, 178, 157, 288, 201, 159, 90, 182, 205, 20, 70, 195, 9, 123, 166, 265, 188, 228, 128, 258, 99, 125, 120, 10, 227, 237, 131, 118, 66, 178, 26, 191, 79, 134, 32, 15, 206, 293, 267, 117, 276, 271, 189, 222, 225, 49, 279, 156, 23, 194, 33, 69, 43, 207, 59, 226, 61, 294, 113, 94, 205, 148, 250, 300, 63, 104, 273, 100, 257, 150, 102, 50, 84, 9, 36, 212, 116, 228, 201, 113, 51, 277, 48, 281, 286, 264, 276, 54, 121, 107, 193, 136, 243, 116, 190, 124, 282, 293, 39, 186, 110, 42, 41, 290, 10, 55, 139, 62, 22, 47, 192, 91, 187, 54, 83, 130, 126, 13, 81, 239, 228, 68, 27, 46, 76, 139, 137, 19, 274, 37, 59, 104, 194, 160, 29, 146, 264, 49, 79, 111, 100, 187, 158, 95, 44, 285, 68, 30, 135, 189, 253, 287, 25, 229, 281, 53, 122, 73, 125, 115, 197, 221, 201, 170, 119, 124, 78, 139, 64, 64, 114, 77, 250, 273, 197, 154, 282, 184, 102, 33, 59, 287, 1, 57, 211, 213, 241, 45, 139, 30, 34, 143, 264, 298, 166, 60, 18, 10, 166, 23, 183, 163, 191, 287, 122, 196, 80, 62, 42, 287, 107, 74, 161, 174, 274, 31, 98, 284, 78, 268, 282, 206, 153, 236, 200, 269, 55, 222, 219, 142, 293, 110, 134, 207, 32, 251, 211, 33, 155, 231, 232, 238, 164, 115, 38, 266, 56, 217, 226, 241, 221, 153, 148, 190, 63, 227, 82, 219, 173, 267, 59, 175, 276, 235, 53, 191, 198, 274, 184, 19, 155, 269, 173, 236, 161, 87, 103, 106, 3, 285, 81, 118, 197, 298, 180, 163, 284, 133, 238, 268, 83, 275, 146, 207, 243, 185, 69, 271, 106, 49, 230, 83, 296, 23, 216, 19, 234, 242, 58, 13, 17, 88, 200, 292, 52, 35, 282, 132, 126, 240, 4, 208, 121, 4, 10, 128, 200, 106, 96, 227, 177, 228, 192, 247, 118, 116, 126, 281, 166, 209, 25, 70, 47, 173, 135, 29, 82, 187, 284, 82, 237, 237, 37, 129, 287, 287, 174, 77, 170, 128, 55, 79, 179, 259, 152, 263, 176, 264, 27, 242, 70, 217, 23, 117, 96, 294, 111, 290, 274, 35, 71, 22, 122, 296, 197, 97, 68, 231, 97, 9, 93, 180, 175, 189, 222, 189, 221, 168, 254, 38, 36, 57, 139, 193, 121, 67, 3, 240, 20, 16, 168, 90, 63, 293, 279, 234, 143, 69, 229, 107, 21, 278, 294, 99, 201, 176, 263, 187, 252, 199, 157, 166, 271, 216, 193, 21, 16, 173, 229, 178, 179, 94, 41, 173, 134, 240, 279, 36, 216, 4, 281, 186, 50, 275, 43, 32, 229, 119, 193, 53, 265, 273, 230, 166, 172, 7, 86, 114, 259, 238, 120, 210, 157, 183, 181, 154, 248, 282, 113, 82, 262, 125, 69, 31, 201, 166, 264, 215, 101, 138, 85, 260, 272, 144, 193, 53, 180, 6, 203, 58, 223, 139, 262, 142, 207, 228, 86, 246, 109, 55, 102, 221, 130, 72, 242, 5, 190, 82, 27, 213, 170, 188, 45, 120, 222, 108, 225, 264, 91, 188, 71, 246, 277, 3, 194, 145, 102, 60, 27, 5, 252, 66, 120, 19, 196, 296, 32, 297, 21, 10, 284, 90, 200, 234, 99, 95, 70, 64, 271, 116, 105, 263, 204, 44, 41, 247, 224, 179, 9, 257, 48, 128, 156, 219, 25, 2, 73, 236, 86, 123, 246, 119, 130, 92, 62, 47, 52, 270, 280, 97, 53, 96, 62, 101, 56, 128, 144, 266, 107, 149, 126, 19, 52, 197, 246, 87, 32, 256, 200, 247, 217, 73, 147, 217, 36, 128, 23, 97, 194, 23, 124, 213, 173, 89, 285, 262, 167, 163, 274, 7, 117, 51, 83, 213, 201, 159, 48, 69, 131, 86, 117, 81, 92, 70, 22, 95, 202, 73, 133, 244, 272, 110, 7, 298, 64, 272, 114, 49, 179, 61, 92, 262, 109, 205, 128, 206, 292, 268, 73, 119, 96, 193, 55, 220, 108, 261, 128, 204, 51, 291, 38, 104, 65, 273, 169, 288, 230, 18, 150, 226, 223, 239, 20, 156]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, 1000 рандомных чисел:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)
arr = [8, 9, 8, 6, 9, 8, 4, 2, 9, 3, 9, 1, 4, 9, 7, 4, 3, 5, 8, 2, 5, 6, 4, 9, 8, 9, 6, 2, 9, 4, 3, 7, 2, 6, 5, 1, 8, 7, 4, 9, 3, 5, 6, 5, 8, 7, 6, 8, 4, 1, 3, 4, 6, 4, 7, 8, 1, 6, 7, 4, 9, 8, 5, 5, 3, 4, 1, 5, 2, 2, 8, 5, 8, 4, 6, 5, 6, 1, 8, 6, 8, 8, 9, 3, 7, 9, 7, 1, 2, 7, 2, 2, 7, 7, 7, 8, 9, 1, 1, 2, 8, 1, 8, 5, 1, 7, 1, 4, 9, 2, 4, 1, 6, 8, 5, 4, 8, 8, 2, 7, 9, 5, 8, 5, 4, 3, 8, 7, 1, 6, 9, 1, 5, 1, 3, 8, 3, 2, 5, 3, 8, 3, 6, 2, 5, 6, 5, 5, 2, 3]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, 150 однозначных чисел:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)
arr = [34, 58, 93, 31, 66, 16, 46, 94, 67, 25, 14, 83, 64, 84, 33, 48, 67, 41, 24, 76, 60, 68, 34, 22, 52, 66, 10, 18, 89, 74, 20, 58, 46, 57, 69, 47, 45, 35, 74, 59, 61, 18, 58, 66, 95, 50, 18, 19, 75, 93, 13, 28, 79, 82, 35, 74, 36, 54, 49, 35, 77, 34, 31, 58, 36, 85, 58, 97, 69, 79, 64, 93, 23, 59, 68, 49, 84, 23, 13, 53, 64, 84, 48, 32, 34, 24, 74, 32, 45, 87, 10, 40, 72, 73, 63, 65, 12, 28, 24, 41, 31, 55, 82, 88, 67, 40, 65, 60, 95, 10, 72, 55, 78, 10, 74, 20, 21, 26, 35, 12, 23, 33, 86, 99, 31, 20, 13, 95, 67, 46, 71, 72, 83, 69, 13, 75, 33, 90, 75, 55, 43, 49, 48, 27, 40, 64, 99, 13, 84, 33]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, 150 двухзначных чисел:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)

arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150]
ser = code(arr)
deser = de_code(ser)
console.log('Исходный массив, 150 чисел подряд:', arr)
console.log('JSON строка:', JSON.stringify(arr))
console.log('Сериализированная строка: ', ser.str.sum)
console.log('Десериализированная строка: ', deser)
console.log('Коэффициент: ', 100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100), '%')
koeff.push(100 - Math.round((ser.str.sum.length/JSON.stringify(arr).length)*100))
console.log(`


Исходный длина  Десериализованный длина
${arr.length} - ${deser.length}


`)
let koef_sum = 0
koeff.forEach((k) => {
   koef_sum += k
})

console.log(koef_sum/koeff.length)